src/InformationRegisters/Спец_СтруктураТаблицБДИзДругихБаз/Спец_СтруктураТаблицБДИзДругихБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_СтруктураТаблицБДИзДругихБаз</name>
  <comment>Регистр для хранения информации по структуре таблиц БД из других баз</comment>
  <resources>
    <name>ГУИДПеречисленияВБазеДанных</name>
    <type>
      <types>DefinedType.Спец_UID</types>
    </type>
  </resources>
  <resources>
    <name>ИмяТипаДанныхДляPostgreSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТаблицыВБД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипДанных</name>
    <type>
      <types>EnumRef.Спец_ТипыДанныхБазыДанных</types>
    </type>
  </resources>
  <resources>
    <name>ТипСоставногоПоля</name>
    <type>
      <types>EnumRef.Спец_ТипыСоставныхПолейБазыДанных</types>
    </type>
  </resources>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТабличнойЧасти</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТаблицыВБД</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяСтолбцаВБД</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Спец_СтруктураТаблицБДИзДругихБаз/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьКрасивуюПанельОтборов();
	Спец_РаботаСФормами.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Спец_РаботаСФормамиКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработкаСобытияОтбора(Элемент, СтандартнаяОбработка = Истина)
	
	Спец_РаботаСФормамиКлиент.ОбработатьСобытиеОтбора(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКрасивуюПанельОтборов()
	
	СтруктураПараметровПанели = Спец_РаботаСФормами.НоваяСтруктураПараметровВыводаПанелиКрасивыхОтборов(Элементы.Список,
			Элементы.НастройкаСписка,
			Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки);
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"База",
			ВидСравненияКомпоновкиДанных.Равно,
			"База");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяОбъектаМетаданных",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя объекта метаданных");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяТабличнойЧасти",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя табличной части");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяРеквизита",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя реквизита");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяТаблицыВБД",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя таблицы в БД");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяСтолбцаВБД",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя столбца в БД");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"КодТаблицыВБД",
			ВидСравненияКомпоновкиДанных.Равно,
			"Код таблицы в БД");
	
	Спец_РаботаСФормами.ВывестиПанельОтборовНаФорму(ЭтотОбъект, СтруктураПараметровПанели);
	
КонецПроцедуры

#КонецОбласти
